UFTOneAutomationTests/APITestCreateOrder/Log/vtd_user.log

2023-12-10 11:51:49,551 [1] INFO  - Loaded appender: FileAppenderInternal
2023-12-10 11:51:49,560 [1] INFO  - Loaded appender: FileAppenderExternal
2023-12-10 11:51:49,561 [1] INFO  - Loaded appender: UserLoggerAppender
2023-12-10 11:51:49,561 [1] INFO  - Loaded appender: FileAppenderInternal
2023-12-10 11:51:49,562 [1] INFO  - Loaded appender: FileAppenderExternal
2023-12-10 11:51:49,562 [1] INFO  - Loaded appender: UserLoggerAppender
2023-12-10 11:51:50,038 [9] INFO  - Step 'Start' : Step 'Start' started
2023-12-10 11:51:50,072 [9] INFO  - Step 'Start' ended successfully
2023-12-10 11:51:50,077 [9] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2023-12-10 11:51:50,312 [9] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2023-12-10 11:51:50,314 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2023-12-10 11:51:50,329 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Seattle</ArrivalCity>
      <FlightDate>2115-06-01T00:00:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2023-12-10 11:51:50,340 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2023-12-10 11:51:50,414 [9] INFO  - Returning the response to the previous channel
2023-12-10 11:51:50,418 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>USA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>12:48 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:38 AM</DepartureTime>
          <FlightNumber>1089</FlightNumber>
          <Price>196.4</Price>
        </Flight>
        <Flight>
          <Airline>USA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>02:00 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>11:50 AM</DepartureTime>
          <FlightNumber>5525</FlightNumber>
          <Price>184</Price>
        </Flight>
        <Flight>
          <Airline>USA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>03:12 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>01:02 PM</DepartureTime>
          <FlightNumber>5774</FlightNumber>
          <Price>185.2</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>03:24 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>6261</FlightNumber>
          <Price>174.47</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>05:48 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>6265</FlightNumber>
          <Price>177.47</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>08:12 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>6269</FlightNumber>
          <Price>170.47</Price>
        </Flight>
        <Flight>
          <Airline>USA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>04:24 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>02:14 PM</DepartureTime>
          <FlightNumber>7194</FlightNumber>
          <Price>199.2</Price>
        </Flight>
        <Flight>
          <Airline>USA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>08:00 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:50 PM</DepartureTime>
          <FlightNumber>7512</FlightNumber>
          <Price>160.4</Price>
        </Flight>
        <Flight>
          <Airline>USA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>11:36 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>09:26 AM</DepartureTime>
          <FlightNumber>7922</FlightNumber>
          <Price>174.4</Price>
        </Flight>
        <Flight>
          <Airline>USA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>10:24 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:14 AM</DepartureTime>
          <FlightNumber>8057</FlightNumber>
          <Price>183.2</Price>
        </Flight>
        <Flight>
          <Airline>USA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>05:36 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:26 PM</DepartureTime>
          <FlightNumber>8383</FlightNumber>
          <Price>183.2</Price>
        </Flight>
        <Flight>
          <Airline>USA</Airline>
          <ArrivalCity>Seattle</ArrivalCity>
          <ArrivalTime>09:12 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>07:02 PM</DepartureTime>
          <FlightNumber>9409</FlightNumber>
          <Price>176.8</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2023-12-10 11:51:50,432 [9] INFO  - Structural Validation: True
2023-12-10 11:51:50,437 [9] INFO  - Step 'GetFlights' ended successfully
2023-12-10 11:51:50,438 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2023-12-10 11:51:50,441 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Economy</Class>
        <CustomerName>Ann Frank</CustomerName>
        <DepartureDate>2115-06-01T00:00:00</DepartureDate>
        <FlightNumber>1089</FlightNumber>
        <NumberOfTickets>3</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2023-12-10 11:51:50,442 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2023-12-10 11:51:50,464 [9] INFO  - Returning the response to the previous channel
2023-12-10 11:51:50,465 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>4124</OrderNumber>
        <TotalPrice>1767.6</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2023-12-10 11:51:50,468 [9] INFO  - Structural Validation: True
2023-12-10 11:51:50,471 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2023-12-10 11:51:50,473 [9] INFO  - Step 'Iteration 1' ended successfully
2023-12-10 11:51:50,474 [9] INFO  - Step 'Test Flow' ended successfully
2023-12-10 11:51:50,692 [9] INFO  - Step 'End' : Step 'End' started
2023-12-10 11:51:50,700 [9] INFO  - Step 'End' ended successfully
